Autodesk.Revit.DB.ScheduleSortOrder
Options for sort order of rows in a schedule.
Since:
2013

Autodesk.Revit.DB.ScheduleSortOrder.Descending
Sort in descending order.

Autodesk.Revit.DB.ScheduleSortOrder.Ascending
Sort in ascending order.